{
    "questions": [
        {
            "question": "Question 1: What are the general labeling requirements for food packages?",
            "ground_truth": "Food packages must include all mandatory label information, ensuring it is visible, legible, and not obscured by any transparent outer layer."
        },
        {
            "question": "Question 2: How are random weight food packages labeled?",
            "ground_truth": "Random weight food packages must display net weight, price per unit of weight, and total price prominently on the principal display panel."
        },
        {
            "question": "Question 3: What are the labeling rules for frozen desserts in specific containers?",
            "ground_truth": "Frozen desserts in half-pint or half-gallon containers may use simplified expressions like '1/2 pint' or '1/2 gallon' to declare net content."
        },
        {
            "question": "Question 4: How must soft drink multiunit retail packages be labeled?",
            "ground_truth": "Soft drink multiunit packages must display product identity and other mandatory information unless already visible on individual containers."
        },
        {
            "question": "Question 5: How is GRAS status determined for substances?",
            "ground_truth": "GRAS status is determined based on scientific procedures or a substantial history of consumption by a significant number of consumers."
        },
        {
            "question": "Question 6: When can food additives bypass regulation?",
            "ground_truth": "Food additives can bypass regulation if they are used in a manner that results in no migration into food or are already GRAS."
        },
        {
            "question": "Question 7: How must food additives in standardized foods be labeled?",
            "ground_truth": "Food additives in standardized foods must comply with the requirements of the specific standard of identity for that food."
        },
        {
            "question": "Question 8: What is required for food additive petitions?",
            "ground_truth": "Food additive petitions must include evidence of safety, chemical composition, manufacturing methods, and proposed conditions of use."
        },
        {
            "question": "Question 9: How are prohibited substances in human food handled?",
            "ground_truth": "Prohibited substances are listed in regulations, and food products containing them are deemed adulterated and subject to enforcement actions."
        },
        {
            "question": "Question 10: How must organic food labels be formatted?",
            "ground_truth": "Organic food labels must include the USDA Organic seal and specify the certifying agency in the information panel."
        },
        {
            "question": "Question 11: What labeling exemptions exist for spices and flavorings?",
            "ground_truth": "Spices and flavorings may be labeled generically unless they contain allergens or are artificial, in which case specific disclosure is required."
        },
        {
            "question": "Question 12: How is the net quantity displayed on food labels?",
            "ground_truth": "Net quantity must be displayed in metric and U.S. customary units, placed prominently on the principal display panel."
        },
        {
            "question": "Question 13: What is the required format for nutrition facts panels?",
            "ground_truth": "Nutrition facts panels must follow a standardized format including serving size, calories, macronutrients, vitamins, and minerals per serving."
        },
        {
            "question": "Question 14: How is the expiration date required to be presented on food labels?",
            "ground_truth": "The expiration date must be clearly displayed in a format that indicates the last date of recommended consumption."
        },
        {
            "question": "Question 15: How are food products certified as gluten-free labeled?",
            "ground_truth": "Gluten-free labels are permitted when the product contains less than 20 parts per million of gluten and meets FDA guidelines."
        },
        {
            "question": "Question 16: What are the requirements for country of origin labeling?",
            "ground_truth": "Country of origin labeling must specify the country where the product was produced, particularly for imported food products."
        },
        {
            "question": "Question 17: What is required for kosher food labeling?",
            "ground_truth": "Kosher labels must indicate certification by a recognized kosher certification agency, ensuring compliance with dietary laws."
        },
        {
            "question": "Question 18: When must warning labels be used on food products?",
            "ground_truth": "Warning labels are required when food products contain substances that pose health risks, such as allergens or high caffeine content."
        },
        {
            "question": "Question 19: What is required for food labels to comply with bilingual regulations?",
            "ground_truth": "Bilingual food labels must include mandatory information in both languages, ensuring readability and compliance with local laws."
        }
    ]
}


